; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=26, out_folder=htg/blocksworld//training, instance_id=6, seed=2030

(define (problem blocksworld-06)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b6)
    (on b6 b11)
    (on b11 b24)
    (on b24 b19)
    (on b19 b23)
    (on b23 b20)
    (on b20 b3)
    (on b3 b18)
    (on b18 b8)
    (on b8 b4)
    (on b4 b9)
    (on b9 b22)
    (on b22 b7)
    (on b7 b21)
    (on b21 b2)
    (on b2 b26)
    (on b26 b5)
    (on b5 b25)
    (on b25 b14)
    (on b14 b15)
    (on b15 b16)
    (on b16 b1)
    (on b1 b17)
    (on b17 b12)
    (on b12 b13)
    (on b13 b10)
    (on-table b10))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on-table b2))))

; plan
1. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 0 of 3
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 3
3. (unstack b11 b24)
   deleted: (on b11 b24) (clear b11) (arm-empty)
   added: (holding b11) (clear b24)
   goals met: 0 of 3
4. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 3
5. (unstack b24 b19)
   deleted: (on b24 b19) (clear b24) (arm-empty)
   added: (holding b24) (clear b19)
   goals met: 0 of 3
6. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 3
7. (unstack b19 b23)
   deleted: (on b19 b23) (clear b19) (arm-empty)
   added: (holding b19) (clear b23)
   goals met: 0 of 3
8. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 3
9. (unstack b23 b20)
   deleted: (on b23 b20) (clear b23) (arm-empty)
   added: (holding b23) (clear b20)
   goals met: 0 of 3
10. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 0 of 3
11. (unstack b20 b3)
   deleted: (on b20 b3) (clear b20) (arm-empty)
   added: (holding b20) (clear b3)
   goals met: 0 of 3
12. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 3
13. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 0 of 3
14. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 3
15. (unstack b18 b8)
   deleted: (on b18 b8) (clear b18) (arm-empty)
   added: (holding b18) (clear b8)
   goals met: 0 of 3
16. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 3
17. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 0 of 3
18. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 3
19. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 0 of 3
20. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 3
21. (unstack b9 b22)
   deleted: (on b9 b22) (clear b9) (arm-empty)
   added: (holding b9) (clear b22)
   goals met: 0 of 3
22. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 3
23. (unstack b22 b7)
   deleted: (on b22 b7) (clear b22) (arm-empty)
   added: (holding b22) (clear b7)
   goals met: 0 of 3
24. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 3
25. (unstack b7 b21)
   deleted: (on b7 b21) (clear b7) (arm-empty)
   added: (holding b7) (clear b21)
   goals met: 0 of 3
26. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 3
27. (unstack b21 b2)
   deleted: (on b21 b2) (clear b21) (arm-empty)
   added: (holding b21) (clear b2)
   goals met: 0 of 3
28. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 3
29. (unstack b2 b26)
   deleted: (on b2 b26) (clear b2) (arm-empty)
   added: (holding b2) (clear b26)
   goals met: 0 of 3
30. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 3
31. (unstack b26 b5)
   deleted: (on b26 b5) (clear b26) (arm-empty)
   added: (holding b26) (clear b5)
   goals met: 1 of 3
32. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 3
33. (unstack b5 b25)
   deleted: (on b5 b25) (clear b5) (arm-empty)
   added: (holding b5) (clear b25)
   goals met: 1 of 3
34. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 3
35. (unstack b25 b14)
   deleted: (on b25 b14) (clear b25) (arm-empty)
   added: (holding b25) (clear b14)
   goals met: 1 of 3
36. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 1 of 3
37. (unstack b14 b15)
   deleted: (on b14 b15) (clear b14) (arm-empty)
   added: (holding b14) (clear b15)
   goals met: 1 of 3
38. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 3
39. (unstack b15 b16)
   deleted: (on b15 b16) (clear b15) (arm-empty)
   added: (holding b15) (clear b16)
   goals met: 1 of 3
40. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 3
41. (unstack b16 b1)
   deleted: (on b16 b1) (clear b16) (arm-empty)
   added: (holding b16) (clear b1)
   goals met: 2 of 3
42. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 3
43. (unstack b1 b17)
   deleted: (on b1 b17) (clear b1) (arm-empty)
   added: (holding b1) (clear b17)
   goals met: 1 of 3
44. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 3 of 3
